toirnewgdktest/src/InformationRegisters/ТекущиеКадровыеДанныеСотрудников/ТекущиеКадровыеДанныеСотрудников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТекущиеКадровыеДанныеСотрудников</name>
  <resources>
    <name>ТекущееПодразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </resources>
  <resources>
    <name>ТекущаяДолжность</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ДатаПриема</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТекущаяДолжностьПоШтатномуРасписанию</name>
    <type>
      <types>CatalogRef.Должности</types>
    </type>
  </resources>
  <resources>
    <name>ДатаУвольнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ОсновноеРабочееМестоВОрганизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТекущийВидЗанятости</name>
    <type>
      <types>EnumRef.ВидыЗанятости</types>
    </type>
  </resources>
  <resources>
    <name>УдалитьТекущаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТекущаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

toirnewgdktest/src/Enums/ВидыЗанятости/ВидыЗанятости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗанятости</name>
  <enumValues>
    <name>ОсновноеМестоРаботы</name>
  </enumValues>
  <enumValues>
    <name>Совместительство</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннееСовместительство</name>
  </enumValues>
</mdclass:Enum>

toirnewgdktest/src/Catalogs/Сотрудники/Сотрудники.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Сотрудники</name>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>ГоловнаяОрганизация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВАрхиве</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НаборыЗначенийДоступа</name>
    <attributes>
      <name>НомерНабора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеДоступа</name>
      <comment>Незаполненные значения нужно допустить, чтобы избежать ошибок при записи проверяемых объектов</comment>
      <type>
        <types>AnyRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Чтение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Изменение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Уточнение</name>
      <type>
        <types>CatalogRef.ИдентификаторыОбъектовМетаданных</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

toirnewgdktest/src/InformationRegisters/ТекущиеКадровыеДанныеСотрудников/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьОсновноеРабочееМестоВОрганизации(НаборЗаписей) Экспорт
	
	Если НаборЗаписей.Количество() = 0 Тогда
		Возврат;
	КонецЕсли; 
	
	ТаблицаТекущегоНабора = НаборЗаписей.Выгрузить();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("ТекущийНабор", ТаблицаТекущегоНабора);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТекущийНабор.Сотрудник КАК Сотрудник,
	|	ТекущийНабор.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ТекущийНабор.ТекущаяОрганизация КАК ТекущаяОрганизация,
	|	ТекущийНабор.ТекущееПодразделение КАК ТекущееПодразделение,
	|	ТекущийНабор.ТекущаяДолжность КАК ТекущаяДолжность,
	|	ТекущийНабор.ДатаПриема КАК ДатаПриема,
	|	ТекущийНабор.ДатаУвольнения КАК ДатаУвольнения,
	|	ТекущийНабор.ОсновноеРабочееМестоВОрганизации КАК ОсновноеРабочееМестоВОрганизации,
	|	ТекущийНабор.ТекущийВидЗанятости КАК ТекущийВидЗанятости
	|ПОМЕСТИТЬ ВТТекущийНабор
	|ИЗ
	|	&ТекущийНабор КАК ТекущийНабор
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТекущиеКадровыеДанныеСотрудников.Сотрудник,
	|	ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо,
	|	ТекущиеКадровыеДанныеСотрудников.ТекущаяОрганизация,
	|	ТекущиеКадровыеДанныеСотрудников.ТекущееПодразделение,
	|	ТекущиеКадровыеДанныеСотрудников.ТекущаяДолжность,
	|	ТекущиеКадровыеДанныеСотрудников.ДатаПриема,
	|	ТекущиеКадровыеДанныеСотрудников.ДатаУвольнения,
	|	ТекущиеКадровыеДанныеСотрудников.ОсновноеРабочееМестоВОрганизации,
	|	ТекущиеКадровыеДанныеСотрудников.ТекущийВидЗанятости КАК ТекущийВидЗанятости
	|ПОМЕСТИТЬ ВТДругиеЗаписи
	|ИЗ
	|	РегистрСведений.ТекущиеКадровыеДанныеСотрудников КАК ТекущиеКадровыеДанныеСотрудников
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТТекущийНабор КАК ТекущийНабор
	|		ПО ТекущиеКадровыеДанныеСотрудников.ФизическоеЛицо = ТекущийНабор.ФизическоеЛицо
	|			И ТекущиеКадровыеДанныеСотрудников.Сотрудник <> ТекущийНабор.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТекущийНабор.Сотрудник,
	|	ТекущийНабор.ФизическоеЛицо,
	|	ТекущийНабор.ТекущаяОрганизация,
	|	ТекущийНабор.ТекущееПодразделение,
	|	ТекущийНабор.ТекущаяДолжность,
	|	ТекущийНабор.ДатаПриема,
	|	ТекущийНабор.ДатаУвольнения,
	|	ТекущийНабор.ОсновноеРабочееМестоВОрганизации,
	|	ТекущийНабор.ТекущийВидЗанятости
	|ПОМЕСТИТЬ ВТВсеЗаписиНабора
	|ИЗ
	|	ВТТекущийНабор КАК ТекущийНабор
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДругиеЗаписи.Сотрудник,
	|	ДругиеЗаписи.ФизическоеЛицо,
	|	ДругиеЗаписи.ТекущаяОрганизация,
	|	ДругиеЗаписи.ТекущееПодразделение,
	|	ДругиеЗаписи.ТекущаяДолжность,
	|	ДругиеЗаписи.ДатаПриема,
	|	ДругиеЗаписи.ДатаУвольнения,
	|	ДругиеЗаписи.ОсновноеРабочееМестоВОрганизации,
	|	ДругиеЗаписи.ТекущийВидЗанятости
	|ИЗ
	|	ВТДругиеЗаписи КАК ДругиеЗаписи
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеЗаписиНабора.Сотрудник,
	|	ВсеЗаписиНабора.ФизическоеЛицо,
	|	ВсеЗаписиНабора.ТекущаяОрганизация,
	|	ВсеЗаписиНабора.ТекущееПодразделение,
	|	ВсеЗаписиНабора.ТекущаяДолжность,
	|	ВсеЗаписиНабора.ДатаПриема,
	|	ВсеЗаписиНабора.ДатаУвольнения,
	|	ВсеЗаписиНабора.ОсновноеРабочееМестоВОрганизации,
	|	ВсеЗаписиНабора.ТекущийВидЗанятости
	|ПОМЕСТИТЬ ВТВсеЗаписиРаботающих
	|ИЗ
	|	ВТВсеЗаписиНабора КАК ВсеЗаписиНабора
	|ГДЕ
	|	ВсеЗаписиНабора.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1)
	|	И ВсеЗаписиНабора.ДатаПриема <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ВсеЗаписиНабора.ТекущаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеЗаписиНабора.Сотрудник,
	|	ВсеЗаписиНабора.ФизическоеЛицо,
	|	ВсеЗаписиНабора.ТекущаяОрганизация,
	|	ВсеЗаписиНабора.ТекущееПодразделение,
	|	ВсеЗаписиНабора.ТекущаяДолжность,
	|	ВсеЗаписиНабора.ДатаПриема,
	|	ВсеЗаписиНабора.ДатаУвольнения КАК ДатаУвольнения,
	|	ВсеЗаписиНабора.ОсновноеРабочееМестоВОрганизации,
	|	ВсеЗаписиНабора.ТекущийВидЗанятости
	|ПОМЕСТИТЬ ВТЗаписиСовсемУволенных
	|ИЗ
	|	ВТВсеЗаписиНабора КАК ВсеЗаписиНабора
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТВсеЗаписиРаботающих КАК ВсеЗаписиРаботающих
	|		ПО
	|	ВсеЗаписиНабора.ФизическоеЛицо = ВсеЗаписиРаботающих.ФизическоеЛицо
	|ГДЕ
	|	ВсеЗаписиРаботающих.Сотрудник ЕСТЬ NULL 
	|	И ВсеЗаписиНабора.ДатаУвольнения <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ВсеЗаписиНабора.ДатаПриема <> ДАТАВРЕМЯ(1, 1, 1)
	|	И ВсеЗаписиНабора.ТекущаяОрганизация <> ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаписиСовсемУволенных.ФизическоеЛицо,
	|	МАКСИМУМ(ЗаписиСовсемУволенных.ДатаУвольнения) КАК ДатаУвольнения
	|ПОМЕСТИТЬ ВТЗаписиСовсемУволенныеСМаксимальнойДатойУвольнения
	|ИЗ
	|	ВТЗаписиСовсемУволенных КАК ЗаписиСовсемУволенных
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаписиСовсемУволенных.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаписиСовсемУволенных.ФизическоеЛицо,
	|	ЗаписиСовсемУволенных.ДатаУвольнения,
	|	МИНИМУМ(ЗаписиСовсемУволенных.ТекущийВидЗанятости.Порядок) КАК ТекущийВидЗанятостиПорядок
	|ПОМЕСТИТЬ ВТСовсемУволенныеСПриоритетом
	|ИЗ
	|	ВТЗаписиСовсемУволенных КАК ЗаписиСовсемУволенных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗаписиСовсемУволенныеСМаксимальнойДатойУвольнения КАК ЗаписиСовсемУволенныеСМаксимальнойДатойУвольнения
	|		ПО ЗаписиСовсемУволенных.ФизическоеЛицо = ЗаписиСовсемУволенныеСМаксимальнойДатойУвольнения.ФизическоеЛицо
	|			И ЗаписиСовсемУволенных.ДатаУвольнения = ЗаписиСовсемУволенныеСМаксимальнойДатойУвольнения.ДатаУвольнения
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаписиСовсемУволенных.ФизическоеЛицо,
	|	ЗаписиСовсемУволенных.ДатаУвольнения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеЗаписиРаботающих.Сотрудник,
	|	ВсеЗаписиРаботающих.ФизическоеЛицо,
	|	ВсеЗаписиРаботающих.ТекущаяОрганизация,
	|	ВсеЗаписиРаботающих.ТекущееПодразделение,
	|	ВсеЗаписиРаботающих.ТекущаяДолжность,
	|	ВсеЗаписиРаботающих.ДатаПриема,
	|	ВсеЗаписиРаботающих.ДатаУвольнения,
	|	ВсеЗаписиРаботающих.ОсновноеРабочееМестоВОрганизации,
	|	ВсеЗаписиРаботающих.ТекущийВидЗанятости
	|ПОМЕСТИТЬ ВТЗаписиКОбработке
	|ИЗ
	|	ВТВсеЗаписиРаботающих КАК ВсеЗаписиРаботающих
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗаписиСовсемУволенных.Сотрудник,
	|	ЗаписиСовсемУволенных.ФизическоеЛицо,
	|	ЗаписиСовсемУволенных.ТекущаяОрганизация,
	|	ЗаписиСовсемУволенных.ТекущееПодразделение,
	|	ЗаписиСовсемУволенных.ТекущаяДолжность,
	|	ЗаписиСовсемУволенных.ДатаПриема,
	|	ЗаписиСовсемУволенных.ДатаУвольнения,
	|	ЗаписиСовсемУволенных.ОсновноеРабочееМестоВОрганизации,
	|	ЗаписиСовсемУволенных.ТекущийВидЗанятости
	|ИЗ
	|	ВТЗаписиСовсемУволенных КАК ЗаписиСовсемУволенных
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТСовсемУволенныеСПриоритетом КАК СовсемУволенныеСПриоритетом
	|		ПО ЗаписиСовсемУволенных.ФизическоеЛицо = СовсемУволенныеСПриоритетом.ФизическоеЛицо
	|			И ЗаписиСовсемУволенных.ТекущийВидЗанятости.Порядок = СовсемУволенныеСПриоритетом.ТекущийВидЗанятостиПорядок
	|			И ЗаписиСовсемУволенных.ДатаУвольнения = СовсемУволенныеСПриоритетом.ДатаУвольнения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВЫРАЗИТЬ(ВсеЗаписиНабора.Сотрудник КАК Справочник.Сотрудники) КАК Сотрудник,
	|	ВсеЗаписиНабора.ФизическоеЛицо,
	|	ВсеЗаписиНабора.ТекущаяОрганизация,
	|	ВсеЗаписиНабора.ТекущееПодразделение,
	|	ВсеЗаписиНабора.ТекущаяДолжность,
	|	ВсеЗаписиНабора.ДатаПриема,
	|	ВсеЗаписиНабора.ДатаУвольнения,
	|	ВсеЗаписиНабора.ОсновноеРабочееМестоВОрганизации,
	|	ВЫРАЗИТЬ(ВсеЗаписиНабора.ТекущийВидЗанятости КАК Перечисление.ВидыЗанятости) КАК ТекущийВидЗанятости,
	|	0 КАК ТекущаяТарифнаяСтавка
	|ПОМЕСТИТЬ ВТВсеЗаписиНабораСТарифнойСтавкой
	|ИЗ
	|	ВТЗаписиКОбработке КАК ВсеЗаписиНабора
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеЗаписиНабораСТарифнойСтавкой.ФизическоеЛицо,
	|	МИНИМУМ(ВсеЗаписиНабораСТарифнойСтавкой.ТекущийВидЗанятости.Порядок) КАК СотрудникВидЗанятостиПорядок
	|ПОМЕСТИТЬ ВТЗаписиСПриоритетомВидаЗанятости
	|ИЗ
	|	ВТВсеЗаписиНабораСТарифнойСтавкой КАК ВсеЗаписиНабораСТарифнойСтавкой
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеЗаписиНабораСТарифнойСтавкой.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаписиСПриоритетомВидаЗанятости.ФизическоеЛицо,
	|	ЗаписиСПриоритетомВидаЗанятости.СотрудникВидЗанятостиПорядок,
	|	МАКСИМУМ(ВсеЗаписиНабораСТарифнойСтавкой.ТекущаяТарифнаяСтавка) КАК ТекущаяТарифнаяСтавка
	|ПОМЕСТИТЬ ВТЗаписиСПриоритетомТарифнойСтавки
	|ИЗ
	|	ВТЗаписиСПриоритетомВидаЗанятости КАК ЗаписиСПриоритетомВидаЗанятости
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВсеЗаписиНабораСТарифнойСтавкой КАК ВсеЗаписиНабораСТарифнойСтавкой
	|		ПО ЗаписиСПриоритетомВидаЗанятости.ФизическоеЛицо = ВсеЗаписиНабораСТарифнойСтавкой.ФизическоеЛицо
	|			И ЗаписиСПриоритетомВидаЗанятости.СотрудникВидЗанятостиПорядок = ВсеЗаписиНабораСТарифнойСтавкой.ТекущийВидЗанятости.Порядок
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаписиСПриоритетомВидаЗанятости.ФизическоеЛицо,
	|	ЗаписиСПриоритетомВидаЗанятости.СотрудникВидЗанятостиПорядок
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаписиСПриоритетомТарифнойСтавки.ФизическоеЛицо,
	|	ЗаписиСПриоритетомТарифнойСтавки.СотрудникВидЗанятостиПорядок,
	|	ЗаписиСПриоритетомТарифнойСтавки.ТекущаяТарифнаяСтавка,
	|	МИНИМУМ(ВсеЗаписиНабораСТарифнойСтавкой.ДатаПриема) КАК ДатаПриема
	|ПОМЕСТИТЬ ВТЗаписиСПриоритетомДатыПриема
	|ИЗ
	|	ВТЗаписиСПриоритетомТарифнойСтавки КАК ЗаписиСПриоритетомТарифнойСтавки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТВсеЗаписиНабораСТарифнойСтавкой КАК ВсеЗаписиНабораСТарифнойСтавкой
	|		ПО ЗаписиСПриоритетомТарифнойСтавки.ФизическоеЛицо = ВсеЗаписиНабораСТарифнойСтавкой.ФизическоеЛицо
	|			И ЗаписиСПриоритетомТарифнойСтавки.СотрудникВидЗанятостиПорядок = ВсеЗаписиНабораСТарифнойСтавкой.ТекущийВидЗанятости.Порядок
	|			И ЗаписиСПриоритетомТарифнойСтавки.ТекущаяТарифнаяСтавка = ВсеЗаписиНабораСТарифнойСтавкой.ТекущаяТарифнаяСтавка
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаписиСПриоритетомТарифнойСтавки.ФизическоеЛицо,
	|	ЗаписиСПриоритетомТарифнойСтавки.СотрудникВидЗанятостиПорядок,
	|	ЗаписиСПриоритетомТарифнойСтавки.ТекущаяТарифнаяСтавка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МИНИМУМ(ВсеЗаписиНабораСТарифнойСтавкой.Сотрудник) КАК Сотрудник,
	|	ВсеЗаписиНабораСТарифнойСтавкой.ФизическоеЛицо
	|ПОМЕСТИТЬ ВТОсновноеМестоРаботы
	|ИЗ
	|	ВТВсеЗаписиНабораСТарифнойСтавкой КАК ВсеЗаписиНабораСТарифнойСтавкой
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТЗаписиСПриоритетомДатыПриема КАК ЗаписиСПриоритетомДатыПриема
	|		ПО ВсеЗаписиНабораСТарифнойСтавкой.ФизическоеЛицо = ЗаписиСПриоритетомДатыПриема.ФизическоеЛицо
	|			И ВсеЗаписиНабораСТарифнойСтавкой.ТекущийВидЗанятости.Порядок = ЗаписиСПриоритетомДатыПриема.СотрудникВидЗанятостиПорядок
	|			И ВсеЗаписиНабораСТарифнойСтавкой.ДатаПриема = ЗаписиСПриоритетомДатыПриема.ДатаПриема
	|
	|СГРУППИРОВАТЬ ПО
	|	ВсеЗаписиНабораСТарифнойСтавкой.ФизическоеЛицо
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеЗаписиНабора.Сотрудник,
	|	ВсеЗаписиНабора.ФизическоеЛицо,
	|	ВсеЗаписиНабора.ТекущаяОрганизация,
	|	ВсеЗаписиНабора.ТекущееПодразделение,
	|	ВсеЗаписиНабора.ТекущаяДолжность,
	|	ВсеЗаписиНабора.ДатаПриема,
	|	ВсеЗаписиНабора.ДатаУвольнения,
	|	ВсеЗаписиНабора.ТекущийВидЗанятости,
	|	ВЫБОР
	|		КОГДА ОсновноеМестоРаботы.Сотрудник ЕСТЬ NULL 
	|			ТОГДА ЛОЖЬ
	|		ИНАЧЕ ИСТИНА
	|	КОНЕЦ КАК ОсновноеРабочееМестоВОрганизации
	|ИЗ
	|	ВТВсеЗаписиНабора КАК ВсеЗаписиНабора
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТОсновноеМестоРаботы КАК ОсновноеМестоРаботы
	|		ПО ВсеЗаписиНабора.Сотрудник = ОсновноеМестоРаботы.Сотрудник
	|ГДЕ
	|	ВЫБОР
	|			КОГДА ОсновноеМестоРаботы.Сотрудник ЕСТЬ NULL 
	|				ТОГДА ЛОЖЬ
	|			ИНАЧЕ ИСТИНА
	|		КОНЕЦ <> ВсеЗаписиНабора.ОсновноеРабочееМестоВОрганизации";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		СтрокаСотрудника = ТаблицаТекущегоНабора.Найти(Выборка.Сотрудник, "Сотрудник");
		
		Если СтрокаСотрудника = Неопределено Тогда
			
			Набор = РегистрыСведений.ТекущиеКадровыеДанныеСотрудников.СоздатьНаборЗаписей();
			Набор.Отбор.Сотрудник.Установить(Выборка.Сотрудник);
			Запись = Набор.Добавить();
			ЗаполнитьЗначенияСвойств(Запись, Выборка);
			Набор.ОбменДанными.Загрузка = Истина;
			Набор.Записать();
			
		Иначе
			
			СтрокаСотрудника.ОсновноеРабочееМестоВОрганизации = Выборка.ОсновноеРабочееМестоВОрганизации;
			
		КонецЕсли;
		
	КонецЦикла;
	
	НаборЗаписей.Загрузить(ТаблицаТекущегоНабора);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
